tap "vladdoster/formulae"
brew "fd"
brew "fzf"
brew "git"
brew "mas"
brew "ncdu"
brew "neovim"
brew "pandoc"
brew "python@3.12"
brew "rsync"
brew "tmux"
brew "uv"
brew "zoxide"
cask "alt-tab"
cask "coteditor"
cask "devcleaner"
cask "font-meslo-lg-nerd-font"
cask "ghostty"
cask "helpwire-operator"
cask "hiddenbar"
cask "iterm2"
cask "itsycal"
cask "karabiner-elements"
cask "keka"
cask "logi-options+"
cask "loop"
cask "maccy"
cask "mos"
cask "obsidian"
cask "pearcleaner"
cask "raycast"
cask "reminders-menubar"
cask "resilio-sync"
cask "shottr"
cask "vimari"
cask "visual-studio-code"
cask "zotero"
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "CotEditor", id: 1024640650
mas "KakaoTalk", id: 869223134
mas "RunCat", id: 1429033973
mas "UpNote", id: 1398373917
mas "Xcode", id: 497799835
