tap "vladdoster/formulae"
brew "cmake"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "huggingface-cli"
brew "mas"
brew "mlx-lm"
brew "ncdu"
brew "neovim"
brew "pandoc"
brew "python@3.12"
brew "rsync"
brew "rust"
brew "tmux"
brew "uv"
brew "yt-dlp"
brew "zoxide"
cask "alt-tab"
cask "claude"
cask "coteditor"
cask "devcleaner"
cask "font-meslo-lg-nerd-font"
cask "ghostty"
cask "hammerspoon"
cask "helpwire-operator"
cask "hiddenbar"
cask "iterm2"
cask "itsycal"
cask "karabiner-elements"
cask "keka"
cask "leader-key"
cask "logi-options+"
cask "loop"
cask "maccy"
cask "macpacker"
cask "mos"
cask "obsidian"
cask "pearcleaner"
cask "raycast"
cask "reminders-menubar"
cask "resilio-sync"
cask "shottr"
cask "the-unarchiver"
cask "vimari"
cask "visual-studio-code"
cask "zotero"
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "CotEditor", id: 1024640650
mas "KakaoTalk", id: 869223134
mas "Photomator", id: 1444636541
mas "RunCat", id: 1429033973
mas "Unicorn Blocker", id: 1231935892
mas "UpNote", id: 1398373917
mas "Xcode", id: 497799835
vscode "anthropic.claude-code"
vscode "efoerster.texlab"
vscode "gitbybit.gitbybit"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "james-yu.latex-workshop"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-repositories"
vscode "targetedwebresults.shimmy-vscode"
vscode "valentjn.vscode-ltex"
